In [1]:
import pandas as pd

df = pd.read_csv('/content/Churn_Modelling.csv')

df.head()

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,1,15634602,Hargrave,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,2,15647311,Hill,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,3,15619304,Onio,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
3,4,15701354,Boni,699,France,Female,39,1,0.00,2,0,0,93826.63,0
4,5,15737888,Mitchell,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0

In [2]:
df.shape

(10000, 14)

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 14 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   RowNumber        10000 non-null  int64
 1   CustomerId       10000 non-null  int64
 2   Surname          10000 non-null  object
 3   CreditScore      10000 non-null  int64
 4   Geography        10000 non-null  object
 5   Gender           10000 non-null  object
 6   Age              10000 non-null  int64
 7   Tenure           10000 non-null  int64
 8   Balance          10000 non-null  float64
 9   NumOfProducts    10000 non-null  int64
 10  HasCrCard        10000 non-null  int64
 11  IsActiveMember   10000 non-null  int64
 12  EstimatedSalary  10000 non-null  float64
 13  Exited           10000 non-null  int64
dtypes: float64(2), int64(9), object(3)
memory usage: 1.1+ MB

In [4]:
#duplicate
df = df.drop_duplicates()

In [5]:
df.isnull().sum()

RowNumber          0
CustomerId         0
Surname            0
CreditScore        0
Geography          0
Gender             0
Age                0
Tenure             0
Balance            0
NumOfProducts      0
HasCrCard          0
IsActiveMember     0
EstimatedSalary    0
Exited             0
dtype: int64

In [6]:
df.columns = df.columns.str.strip().str.lower().str.replace(' ', '_')

In [7]:
df.dtypes

rownumber            int64
customerid           int64
surname             object
creditscore          int64
geography           object
gender              object
age                  int64
tenure               int64
balance            float64
numofproducts        int64
hascrcard            int64
isactivemember       int64
estimatedsalary    float64
exited               int64
dtype: object

In [8]:
df['creditscore'] = df['creditscore'].astype(int)
df['age'] = df['age'].astype(int)

In [10]:
# age group
df['age_group'] = pd.cut(df['age'],
                         bins=[18,30,45,60,100],
                         labels=['young','adult','mid','senior'])

# balance flag
df['has_balance'] = df['balance'].apply(lambda x: 1 if x > 0 else 0)

# salary in k
df['salary_k'] = df['estimatedsalary'] / 1000

In [14]:
df.to_csv('processed_data.csv', index=False)

In [16]:
#Customer Table

customers = df[['customerid','surname','geography','gender','age']]
customers.to_csv('customers.csv', index=False)

In [17]:
#Account Table

accounts = df[['customerid','creditscore','balance','numofproducts','hascrcard','isactivemember']]
accounts.to_csv('accounts.csv', index=False)

In [18]:
#Churn Table

churn = df[['customerid','exited']]
churn.to_csv('churn.csv', index=False)

In [19]:
import sqlite3

conn = sqlite3.connect('database.sqlite')

customers.to_sql('customers', conn, if_exists='replace', index=False)
accounts.to_sql('accounts', conn, if_exists='replace', index=False)
churn.to_sql('churn', conn, if_exists='replace', index=False)

conn.close()

In [20]:
print("Raw count:", len(pd.read_csv('/content/Churn_Modelling.csv')))
print("Processed count:", len(df))
print("Customers:", len(customers))

Raw count: 10000
Processed count: 10000
Customers: 10000